module.exports.config = {
    name: 'autotime',
    version: '10.02',
    hasPermssion: 0,
    credits: 'MrTomXxX',
    description: 'সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!',
    commandCategory: 'group messenger',
    usages: '[]',
    cooldowns: 3,
     envConfig: {
        autoUnsend: false,
        sendNoti: true,
        timeToUnsend: 10
    }
};
const nam = [{
    timer: '12:30:00 PM',
    message: ['ہمارے ساتھ کوئی بیٹھ کر نہیں رویا۔
سبھی نے جان چھڑائی دعائیں دیتے ہوے۔💯🥺💔 ']
},
             {
    timer: '1:30:00 PM',
    message: ['~ وہ تیرا  ایک وعدہ کہ ھم  کبھی جدا  نہیں 
ھوں گے💔💔
وہ قصہ ھم اکثر اپنے دل کو سنا کر مسکراتے ہیں💝💝 ']
},
						{
    timer: '2:30:00 PM',
    message: ['~_______!!!💔 کہ ساتھ چلو تو پورے سفر تک،، مر جانے کی اگلی خبر تک دیکھو پھر تم چھوڑ نہ جانا_________

چھوڑ گئے تو واپس نہ آنا جو چھوڑ دیا وہ تیرا نہیں ہے،،اور جو چلا گیا وہ میرا نہیں ہے_______!!!💔']
},
						 {
    timer: '3:30:00 PM',
    message: ['~.

*_کیوں تیری حسرت ہے ھر خواہش سے بڑھ کر مجھے"💕🦋*

🌸🌎_*রি ']
},
			
						 {
    timer: '4:30:00 PM',
    message: ['~اب تم لوٹ انے کی تکلیف مت کرنا 
😩
ہم نے بہت گندی گندی گلیا سکھ لی ہیں۔🙂🔪 ']
},
						 {
    timer: '5:30:00 PM',
    message: ['__انمــــول تو نہیں ہم مگر یہ خیــال رکھـنا تـــــــم 😊*
❣❣
*ہمــــارے بعـــد شاید کوئی ہم جیســــــا نا ملـــے...!* ']
},
             
						 {
    timer: '6:30:00 PM',
    message: ['~وس م ناھي جو مان وساري ڇڏيان
رات ناھي جو مان گذاري ڇڏيان
درد آهن ت ڏکائين ٿا
پکي ھجن ته مان اداري ڇڏيان,❤️‍🩹🍁']
},
						 {
    timer: '7:30:00 PM',
    message: ['تو نے شاید غلطی سے ڈھونڈ لیا تھا مجھے...
تجھے تلاش شاید کسی اور کی تھی.... 🦋 🥀😊😊ে']
},
             {
    timer: '8:30:00 AM',
    message: ['~ایک دن اپنی ساری اداسیاں لے کر 😳
اپنے اللّه پاک کے پاس چلے جائے گے 🌷
ان شا اللّه 🙂ো  ']
},
						 {
    timer: '9:00:00 AM',
    message: ['~نہیں تھا اعتبار اس کو میری مخلصی پر 💔

کھو دیا اس نے مجھے آزماتے آزماتے....💔
🍁🍂ো']
},
             {
    timer: '10:00:00 AM',
    message: ['~‏ہم سے پوچھو کہ محبت میں خسارہ کیا ہے
جان لے کر بھی کوئی پوچھے کہ ہارا کیا ہے
اک عمر کٹی ، جن کی وفاداری میں ۔۔۔۔۔۔!
ہاے وہ کہتے ہیں، تم تو پاگل ہو تمھارا کیا ہے' ]
},
						 {
    timer: '11:00:00 AM',
    message: ['~ہمیں پرندوں  کے جیسا حساس دل دے کر 
درندوں کی بستی میں اُتار دیا گیا ہے۔🥀❤️‍🩹  ']
},
						 {
    timer: '12:00:00 PM',
    message: ['~اس دل میں ,, 
کس کس کو جگہ دے جاناں ,,
غم رکھے ، دم رکھے ، فریاد رکھے ، یا تیری یاد رکھے "🍁❤️‍🩹']
},					
						 {
    timer: '1:00:00 PM',
    message: ['~*قرآن کہتا ہے...♥️*
*`"والَسوفَيُعطيكَرَبُكَفَتَرضٰى"`*
*_`اور جلد ہی آپ کا رب آپکو اتنا دے گا کہ آپ خوش ہو جائیں گے۔))❤🙂-_*
_*▢⃝─────────────▢⃝🕌`♥️*_🥺🌼🌼 ❤️ ']
},
						 {
    timer: '2:00:00 PM',
    message: ['~_" خیال اُنھی کے آتے ہیں جن سے دل کا رشتہ ہو🙂🌸”

”ہر شخص اپنا ہو جائے سوال ہی پیدا نہیں ہوتا_"🖤 ']
},
						 {
    timer: '3:00:00 PM',
    message: ['~‏اس سے پہلے تو دعاؤں پہ یقیں تھا کم کم
تؤ نے چھوڑا تو مناجات کا مطلب سمجھے

تجھ کو بھی چھوڑ کے جائے تیرا اپنا کوئی
تؤ بھی اک روز مکافات کا مطلب سمجھے۔۔۔']
},
						 {
    timer: '4:00:00 PM',
    message: ['~خود کا نہیں تو سہیلی کا نمبر
 ہی دے دو __🤌🤧Alon ']
},
						{
    timer: '5:00:00 PM',
    message: ['~ پپو نے لڑکی کو کہا " I love U "...
لڑکی نے تھپڑ مارا اور غصے میں بولی
کیا کہا..! 
پپو نے لڑکی کو واپس تھپڑ مارا اور کہا : 

انی دئیے جے سنیا نئ سی تے ماریا کیوں__،،
🙄😬😬🤣😜 ']
},
						 {
    timer: '6:00:00 PM',
    message: ['~وہ بھی یوسف کی طرح آئے جو کبھی محفل میں 
 غرق ِ حیرت ہوں وہاں ساری کی ساری آنکھیں ,, ']
},
						 {
    timer: '7:00:00 PM',
    message: ['~تجھ کو معلوم نہیں میرے غم کی حقیقت ورنہ 
تو بھی میرے ساتھ بھرے شہر میں ماتم کرتا
💔🥀🙂 ']
},
          {
    timer: '8:00:00 PM',
    message: ['-" ‏ﺗﮩﻤﺘﯿﮟ ﺍﺗـﺎﺭ ﭘﮭﯿﻨــکیں، ﻟــﺒﺎﺩﮦ ﺑـﺪﻝ ﻟﯿـﺎ
ﺧﻮﺩ ﮐﻮﺿﺮﻭﺭﺗﻮﮞ ﺳﮯﺯﯾﺎﺩﮦ ﺑـﺪﻝ ﻟﯿـﺎ

ﺟﯽ ﭼﺎﮨﺘﺎ ﺗﮭﺎ ﺭوﺅﮞ ﺍﺳﮯ ﺟﺎﮞ ﺳﮯ ﻣﺎﺭ ﮐﮯ
ﺁﻧﮑﮭﯿﮟ ﭼﮭﻠﮏ ﭘﮍﯾﮟ ﺗﻮ ﺍﺭﺍﺩﮦ ﺑﺪﻝ لیا...🖤 "•']
},
             {
    timer: '9:00:00 PM',
    message: ['~💞حسین اور بھی ہیں دنیا میں بہت ✌️
                     🦋 لیکن 🍂
🦋 ہم مسکرا ☺کر زمانہ خرید لیتے ہیں💞💯 
Meeru']
},
             {
    timer: '9:20:00 PM',
    message: ['*انمــــول تو نہیں ہم مگر یہ خیــال رکھـنا تـــــــم 👀✨*

*ہمــــارے بعـــد شاید کوئی ہم جیســــــا نا ملـــے 🫠🍂 /n/n Professor*']
},
            {
    timer: '11:00:00 PM',
    message: ['~"میرا بس چلے تو تیری ادائیں خرید لوں"

"اپنےدل کے واسطے تیری وفائیں خرید لوں"

"کر سکے جوہروقت دیدار تیرا "

"سب کچھ لٹا کے وہ نگاھیں خرید لوں..💚💚💚ো']
}]; 
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
